#! /usr/bin/env python3
# -*- coding: utf-8 -*-

find_list = [
"专页063", "FB专页235", "FB专页020", "FB专页066", "FB专页237", "FB专页243", "FB专页013", "FB专页240", "FB专页003", "专页067", "FB专页082", "专页024", "FB专页024", "专页092", "FB专页051", "专页025", "FB专页028", "专页108", "FB专页026", "FB专页053", "FB专页205", "FB专页231", "FB专页079", "FB专页212", "专页082", "专页007", "FB专页009", "FB专页049", "FB专页113", "FB专页092", "FB专页117", "FB专页018", "FB专页214", "FB专页081", "FB专业210", "FB专页249", "FB专页006", "专页001"
]

all_list = [
"FB专页064", "FB专页220", "FB专页223", "FB专页224", "FB专页003", "FB专页027", "FB专页038", "FB专页049", "FB专页052", "FB专页053", "FB专页059", "FB专页071", "FB专页073", "FB专页074", "FB专页079", "FB专页089", "FB专页093", "FB专页098", "FB专页101", "FB专页113", "FB专页115", "FB专页117", "FB专页119", "FB专页124", "FB专页135", "FB专页201", "FB专页217", "FB专页230", "FB专页231", "FB专页243", "FB专页245", "FB专页247", "FB专页248", "FB专页249", "FB专页253", "FB专页259", "FB专页260", "FB专页261", "FB专页263", "FB专页264", "FB专页266", "FB专页267", "FB专页268", "FB专页269", "FB专页271", "FB专页272", "FB专页011", "FB专页012", "FB专页013", "FB专页017", "FB专页020", "FB专页022", "FB专页023", "FB专页031", "FB专页116", "FB专页118", "FB专页006", "FB专页015", "FB专页026", "FB专页205", "FB专页211", "FB专页212", "FB专页214", "FB专页221", "FB专页225", "FB专页228", "FB专页234", "FB专页235", "FB专页237", "FB专页239", "FB专页240", "FB专页241", "FB专页270", "专页008", "专页009", "专页010", "专页014", "专页016", "专页024", "专页028", "专页045", "专页051", "专页061", "专页063", "专页066", "专页067", "专页081", "专页082", "专页092", "专页210", "专页215", "专页001", "专页004", "专页005", "专页018", "专页019", "专页025", "专页002", "专页007", "专页069"
]


for fn in find_list:
    if fn not in all_list:
        print("find: \t", fn)

